
&НаКлиенте
Процедура ПолучитьКурсыВалют(Команда)
	//https://www.nbrb.by/api/exrates/rates?ondate=2016-7-6&periodicity=0
	
	
	ПолучитьКурсыВалютНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьКурсыВалютНаСервере()
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
	СоединениеHTTP = Новый HTTPСоединение("www.nbrb.by", , , , , 30, ЗащищенноеСоединение);

	ПараметрДатыЗапроса = Формат(ДатаЗапроса, "ДФ=yyyy-MM-dd;");
	АдресРестурса = "/api/exrates/rates?ondate=" + ПараметрДатыЗапроса + "&periodicity=0";

	ЗапросHTTP = Новый HTTPЗапрос(АдресРестурса);

	ОтветСервера = СоединениеHTTP.ВызватьHTTPМетод("GET", ЗапросHTTP);

	Если ОтветСервера.КодСостояния = 200 Тогда

		ТелоОтвета = ОтветСервера.ПолучитьТелоКакСтроку();
		ЧтениеЖЫСОН = Новый ЧтениеJSON;
		ЧтениеЖЫСОН.УстановитьСтроку(ТелоОтвета);
		МассивСоответствийКурсовВалют = ПрочитатьJSON(ЧтениеЖЫСОН, Истина);

	КонецЕсли;
		
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаЗапроса = ТекущаяДата();
КонецПроцедуры

